<!-- dflook/terraform-github-actions {"workspace":"prod","backend_type":"azurerm","backend":"bb9b2f798b22afd47b36c07eeb1df2e3c5bc1427007a2acad57ec0b89943777a","plan_job_ref":"Job CI-CD pipeline #5 at https://github.com/HasanAshab/go-web-app-infra/actions/runs/15803632517","plan_out_hash":"f3443f14a9cf0a3c2f76835b9f5cc887bef8411b01cb4e8eaff9d44d310334cd","plan_hash":"c20b4b65bbb7270fc35672341c7a58f4e3fc1cd2656fe7ab0194f6dddeb07393","plan_text_format":"diff","version":"2.1.0","closed":true} -->
Terraform plan in __.__ in the __prod__ workspace
With var files: `prod.tfvars`
<details>
<summary>Plan: 2 to add, 0 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # azurerm_kubernetes_cluster.main will be created
+   resource "azurerm_kubernetes_cluster" "main" {
+       current_kubernetes_version          = (known after apply)
+       dns_prefix                          = "aksprodeastus001"
+       fqdn                                = (known after apply)
+       http_application_routing_zone_name  = (known after apply)
+       id                                  = (known after apply)
+       kube_admin_config                   = (sensitive value)
+       kube_admin_config_raw               = (sensitive value)
+       kube_config                         = (sensitive value)
+       kube_config_raw                     = (sensitive value)
+       kubernetes_version                  = (known after apply)
+       location                            = "eastus"
+       name                                = "aks-prod-eastus-001"
+       node_os_upgrade_channel             = "NodeImage"
+       node_resource_group                 = (known after apply)
+       node_resource_group_id              = (known after apply)
+       oidc_issuer_url                     = (known after apply)
+       portal_fqdn                         = (known after apply)
+       private_cluster_enabled             = false
+       private_cluster_public_fqdn_enabled = false
+       private_dns_zone_id                 = (known after apply)
+       private_fqdn                        = (known after apply)
+       resource_group_name                 = "rg-go-web-app-prod"
+       role_based_access_control_enabled   = true
+       run_command_enabled                 = true
+       sku_tier                            = "Free"
+       support_plan                        = "KubernetesOfficial"
+       tags                                = {
+           "Environment" = "prod"
+           "Service"     = "aks"
        }
+       workload_identity_enabled           = false

+       auto_scaler_profile (known after apply)

+       default_node_pool {
+           kubelet_disk_type    = (known after apply)
+           max_pods             = (known after apply)
+           name                 = "default"
+           node_count           = 1
+           node_labels          = (known after apply)
+           orchestrator_version = (known after apply)
+           os_disk_size_gb      = (known after apply)
+           os_disk_type         = "Managed"
+           os_sku               = (known after apply)
+           scale_down_mode      = "Delete"
+           type                 = "VirtualMachineScaleSets"
+           ultra_ssd_enabled    = false
+           vm_size              = "Standard_D2_v2"
+           workload_runtime     = (known after apply)
        }

+       identity {
+           principal_id = (known after apply)
+           tenant_id    = (known after apply)
+           type         = "SystemAssigned"
        }

+       kubelet_identity (known after apply)

+       network_profile (known after apply)

+       windows_profile (known after apply)
    }

  # azurerm_resource_group.main will be created
+   resource "azurerm_resource_group" "main" {
+       id       = (known after apply)
+       location = "eastus"
+       name     = "rg-go-web-app-prod"
+       tags     = {
+           "Environment" = "prod"
+           "Service"     = "go-web-app"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.
```
</details>

:x: Error applying plan in [CI-CD pipeline #6](https://github.com/HasanAshab/go-web-app-infra/actions/runs/15803659175)